In [2]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.716885  0.175662  0.364718
1  0.563017 -1.646478  2.409898
2  0.196793  1.218315  0.982833
3 -0.391204  0.761000 -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [17]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

In [18]:
df

          0         1         2
0 -0.716885       NaN       NaN
1  0.563017       NaN       NaN
2  0.196793       NaN  0.982833
3 -0.391204       NaN -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [19]:
df.dropna()

          0         1         2
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [21]:
# define atleast 2 non na values 
df.dropna(thresh=2)

          0         1         2
2  0.196793       NaN  0.982833
3 -0.391204       NaN -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [22]:
df

          0         1         2
0 -0.716885       NaN       NaN
1  0.563017       NaN       NaN
2  0.196793       NaN  0.982833
3 -0.391204       NaN -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [23]:
df.fillna(0)

          0         1         2
0 -0.716885  0.000000  0.000000
1  0.563017  0.000000  0.000000
2  0.196793  0.000000  0.982833
3 -0.391204  0.000000 -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.716885  0.500000  0.000000
1  0.563017  0.500000  0.000000
2  0.196793  0.500000  0.982833
3 -0.391204  0.500000 -1.350487
4  0.370001 -0.390346 -1.539442
5 -0.337499 -0.262720 -0.065248
6 -0.033961 -0.015307  2.335947

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))

In [26]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [27]:
df

          0         1         2
0 -1.307363  1.356739  0.636366
1  1.149782 -0.932027 -0.699394
2  0.669959       NaN -0.565863
3 -0.312817       NaN  1.018622
4  3.308504       NaN       NaN
5  0.721187       NaN       NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0 -1.307363  1.356739  0.636366
1  1.149782 -0.932027 -0.699394
2  0.669959 -0.932027 -0.565863
3 -0.312817 -0.932027  1.018622
4  3.308504 -0.932027  1.018622
5  0.721187 -0.932027  1.018622

In [29]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.307363  1.356739  0.636366
1  1.149782 -0.932027 -0.699394
2  0.669959 -0.932027 -0.565863
3 -0.312817 -0.932027  1.018622
4  3.308504       NaN  1.018622
5  0.721187       NaN  1.018622

In [30]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [31]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64